[
  {
    "title": "Python Programming",
    "authors": [
      "John M. Zelle"
    ],
    "description": "This book is suitable for use in a university-level first course in computing (CS1), as well as the increasingly popular course known as CS0. It is difficult for many students to master basic concepts in computer science and programming. A large portion of the confusion can be blamed on the complexity of the tools and materials that are traditionally used to teach CS1 and CS2. This textbook was written with a single overarching goal: to present the core concepts of computer science as simply as possible without being simplistic.",
    "cover_image": "http://books.google.com/books/content?id=aJQILlLxRmAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2004"
  },
  {
    "title": "Expert Python Programming",
    "authors": [
      "Michał Jaworski",
      "Tarek Ziadé"
    ],
    "description": "Gain a deep understanding of building, maintaining, packaging, and shipping robust Python applications Key FeaturesDiscover the new features of Python, such as dictionary merge, the zoneinfo module, and structural pattern matchingCreate manageable code to run in various environments with different sets of dependenciesImplement effective Python data structures and algorithms to write, test, and optimize codeBook Description This new edition of Expert Python Programming provides you with a thorough understanding of the process of building and maintaining Python apps. Complete with best practices, useful tools, and standards implemented by professional Python developers, this fourth edition has been extensively updated. Throughout this book, you’ll get acquainted with the latest Python improvements, syntax elements, and interesting tools to boost your development efficiency. The initial few chapters will allow experienced programmers coming from different languages to transition to the Python ecosystem. You will explore common software design patterns and various programming methodologies, such as event-driven programming, concurrency, and metaprogramming. You will also go through complex code examples and try to solve meaningful problems by bridging Python with C and C++, writing extensions that benefit from the strengths of multiple languages. Finally, you will understand the complete lifetime of any application after it goes live, including packaging and testing automation. By the end of this book, you will have gained actionable Python programming insights that will help you effectively solve challenging problems. What you will learnExplore modern ways of setting up repeatable and consistent Python development environmentsEffectively package Python code for community and production useLearn modern syntax elements of Python programming, such as f-strings, enums, and lambda functionsDemystify metaprogramming in Python with metaclassesWrite concurrent code in PythonExtend and integrate Python with code written in C and C++Who this book is for The Python programming book is intended for expert programmers who want to learn Python’s advanced-level concepts and latest features. Anyone who has basic Python skills should be able to follow the content of the book, although it might require some additional effort from less experienced programmers. It should also be a good introduction to Python 3.9 for those who are still a bit behind and continue to use other older versions.",
    "cover_image": "http://books.google.com/books/content?id=2tAwEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2021"
  },
  {
    "title": "Python for Kids",
    "authors": [
      "Jason R. Briggs"
    ],
    "description": "Python is a powerful, expressive programming language that’s easy to learn and fun to use! But books about learning to program in Python can be kind of dull, gray, and boring, and that’s no fun for anyone. Python for Kids brings Python to life and brings you (and your parents) into the world of programming. The ever-patient Jason R. Briggs will guide you through the basics as you experiment with unique (and often hilarious) example programs that feature ravenous monsters, secret agents, thieving ravens, and more. New terms are defined; code is colored, dissected, and explained; and quirky, full-color illustrations keep things on the lighter side. Chapters end with programming puzzles designed to stretch your brain and strengthen your understanding. By the end of the book you’ll have programmed two complete games: a clone of the famous Pong and \"Mr. Stick Man Races for the Exit\"—a platform game with jumps, animation, and much more. As you strike out on your programming adventure, you’ll learn how to: –Use fundamental data structures like lists, tuples, and maps –Organize and reuse your code with functions and modules –Use control structures like loops and conditional statements –Draw shapes and patterns with Python’s turtle module –Create games, animations, and other graphical wonders with tkinter Why should serious adults have all the fun? Python for Kids is your ticket into the amazing world of computer programming. For kids ages 10+ (and their parents) The code in this book runs on almost anything: Windows, Mac, Linux, even an OLPC laptop or Raspberry Pi!",
    "cover_image": "http://books.google.com/books/content?id=pMEUG8oNBfkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2012"
  },
  {
    "title": "Expert Python Programming",
    "authors": [
      "Michał Jaworski",
      "Tarek Ziadé"
    ],
    "description": "Refine your Python programming skills and build professional grade applications with this comprehensive guide Key FeaturesCreate manageable code that can run in various environments with different sets of dependenciesImplement effective Python data structures and algorithms to write optimized codeDiscover the exciting new features of Python 3.7Book Description Python is a dynamic programming language that's used in a wide range of domains thanks to its simple yet powerful nature. Although writing Python code is easy, making it readable, reusable, and easy to maintain is challenging. Complete with best practices, useful tools, and standards implemented by professional Python developers, the third edition of Expert Python Programming will help you overcome this challenge. The book will start by taking you through the new features in Python 3.7. You'll then learn the advanced components of Python syntax, in addition to understanding how to apply concepts of various programming paradigms, including object-oriented programming, functional programming, and event-driven programming. This book will also guide you through learning the best naming practices, writing your own distributable Python packages, and getting up to speed with automated ways of deploying your software on remote servers. You’ll discover how to create useful Python extensions with C, C++, Cython, and CFFI. Furthermore, studying about code management tools, writing clear documentation, and exploring test-driven development will help you write clean code. By the end of the book, you will have become an expert in writing efficient and maintainable Python code. What you will learnExplore modern ways of setting up repeatable and consistent development environmentsPackage Python code effectively for community and production useLearn modern syntax elements of Python programming such as f-strings, enums, and lambda functionsDemystify metaprogramming in Python with metaclassesWrite concurrent code in PythonExtend Python with code written in different languagesIntegrate Python with code written in different languagesWho this book is for This book will appeal to you if you’re a programmer looking to take your Python knowledge to the next level by writing efficient code and learning the latest features of version 3.7 and above.",
    "cover_image": "http://books.google.com/books/content?id=s1mWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2019"
  },
  {
    "title": "Python Programming for Data Analysis",
    "authors": [
      "José Unpingco"
    ],
    "description": "This textbook grew out of notes for the ECE143 Programming for Data Analysis class that the author has been teaching at University of California, San Diego, which is a requirement for both graduate and undergraduate degrees in Machine Learning and Data Science. This book is ideal for readers with some Python programming experience. The book covers key language concepts that must be understood to program effectively, especially for data analysis applications. Certain low-level language features are discussed in detail, especially Python memory management and data structures. Using Python effectively means taking advantage of its vast ecosystem. The book discusses Python package management and how to use third-party modules as well as how to structure your own Python modules. The section on object-oriented programming explains features of the language that facilitate common programming patterns. After developing the key Python language features, the book moves on to third-party modules that are foundational for effective data analysis, starting with Numpy. The book develops key Numpy concepts and discusses internal Numpy array data structures and memory usage. Then, the author moves onto Pandas and details its many features for data processing and alignment. Because strong visualizations are important for communicating data analysis, key modules such as Matplotlib are developed in detail, along with web-based options such as Bokeh, Holoviews, Altair, and Plotly. The text is sprinkled with many tricks-of-the-trade that help avoid common pitfalls. The author explains the internal logic embodied in the Python language so that readers can get into the Python mindset and make better design choices in their codes, which is especially helpful for newcomers to both Python and data analysis. To get the most out of this book, open a Python interpreter and type along with the many code samples.",
    "cover_image": "http://books.google.com/books/content?id=f7osEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2021"
  },
  {
    "title": "Python Programming Fundamentals",
    "authors": [
      "Kent D. Lee"
    ],
    "description": "This easy-to-follow and classroom-tested textbook guides the reader through the fundamentals of programming with Python, an accessible language which can be learned incrementally. Features: incudes numerous examples and practice exercises throughout the text, with additional exercises, solutions and review questions at the end of each chapter; highlights the patterns which frequently appear when writing programs, reinforcing the application of these patterns for problem-solving through practice exercises; introduces the use of a debugger tool to inspect a program, enabling students to discover for themselves how programs work and enhance their understanding; presents the Tkinter framework for building graphical user interface applications and event-driven programs; provides instructional videos and additional information for students, as well as support materials for instructors, at an associated website.",
    "cover_image": "http://books.google.com/books/content?id=SOwXBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2015"
  },
  {
    "title": "Basics of Python Programming",
    "authors": [
      "Dr. Pratiyush Guleria"
    ],
    "description": "Learn a Programmer-Friendly language KEY FEATURES Strengthens the foundations, as a detailed explanation of programming language concepts are given in a simple mannerÊÊÊÊÊÊÊÊÊÊÊÊÊÊÊ Lists down all the important points that you need to know related to various topics in an organized manner Prepares you for coding related interview and theoretical questions Provides an in-depth explanation of complex topics and Questions It focuses on how to think logically to solve a problem Follows a systematic approach that will help you to prepare for an interview in a short duration of time Exercises are exceptionally useful to complete the readerÕs understanding of a topic DESCRIPTION Book will come as a relief to the students wishing to go through a comprehensive work explaining the programming concepts of Python. Examples are given with proper description, offering a variety of practical examples and conceptual problems along with their systematically worked out solutions. It also covers all the concepts which are helpful for the students and beginners to learn the basics of Python programming. Ê WHAT WILL YOU LEARN This book is written, taking into consideration the skills required at the beginner level for understanding Python Programming Concepts. The book covers the practical examples of Python in an easy way so that students can able to understand efficiently. Ê WHO THIS BOOK IS FOR Book promises to be a perfect starting point for beginners and an asset for those having insight towards programming.Ê Table of ContentsÊ 1. IntroductionÊ 2. Conditions and Loops 3. Arrays and Functions 4. Lists, Tuples, Iterators and GeneratorsDictionaries and Modules 5. File Handling and Databases 6. Object-Oriented Programming 7. Regular Expressions, Date, and Time 8. Exception Handling 9. Practice Exercise",
    "cover_image": "http://books.google.com/books/content?id=lMfaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2020"
  },
  {
    "title": "Mathematics and Python Programming",
    "authors": [
      "J.C. Bautista"
    ],
    "description": "\"We have developed 120 Python programs and more than 110 illustrations in a work that will be useful both to students of science of the first university science courses, as well as high school students and teachers, and to anyone interested in Python programming intending to acquire new tools to expose mathematical concepts in a didactic and modern fashion ... The book begins with a detailed introduction to Python, followed by ten chapters of mathematics with its corresponding Python programs, results and graphs.\"--Cover.",
    "cover_image": "http://books.google.com/books/content?id=K0B8BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2014"
  },
  {
    "title": "Learn Python Programming",
    "authors": [
      "Fabrizio Romano"
    ],
    "description": "Build a solid foundation in coding by utilizing the language and its core characteristics Key Features Leverage the features of Python programming through easy-to-follow examples Develop a strong set of programming skills that can be applied on all platforms Create GUIs and data science-based applications Book Description Learn Python Programming creates a foundation for those who are interested in developing their skills in Python programming. The book starts with the fundamentals of programming with Python and ends by exploring different topics such as GUIs and real-world apps. You will begin by exploring the foundations of and fundamental topics on Python and learn to manipulate them. Then, you'll explore different programming paradigms that will allow you to find the best approach to a situation, and you’ll also understand how to carry out performance optimization as well as effective debugging. As you make your way through the chapters, you'll control the flow of a program, and persist and utilize an interchange format to exchange data. You'll also walk through cryptographic services in Python and understand secure tokens. Throughout, the book covers various types of applications, and it concludes with building real-world applications based on all the concepts that you learned. By the end of the book, you'll have a proper understanding of the Python language and a solid grasp on how to work with data. You'll know how to quickly build a website and harness the power of Python's renowned data science libraries. What you will learn Get Python up and running on Windows, Mac, and Linux Grasp fundamental concepts of coding using data structures and control flow Write elegant, reusable, and efficient code in any situation Understand when to use the functional or object-oriented programming (OOP) approach Walk through the basics of security and concurrent/asynchronous programming Create bulletproof, reliable software by writing tests Explore examples of GUIs, scripting, and data science Who this book is for Learn Python Programming is for individuals with relatively little experience in coding or Python. It's also ideal for aspiring programmers who need to write scripts or programs to accomplish tasks. The book takes you all the way to creating a full-fledged application.",
    "cover_image": "http://books.google.com/books/content?id=NsNiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2018"
  },
  {
    "title": "Python Programming in Context",
    "authors": [
      "Bradley N. Miller",
      "David L. Ranum",
      "Julie Anderson"
    ],
    "description": "Python Programming in Context, Third Edition provides a comprehensive and accessible introduction to Python fundamentals. Updated with the latest version of Python, the new Third Edition offers a thorough overview of multiple applied areas, including image processing, cryptography, astronomy, the Internet, and bioinformatics. Taking an active learning approach, each chapter starts with a comprehensive real-world project that teaches core design techniques and Python programming while engaging students. An ideal first language for learners entering the rapidly expanding field of computer science, Python gives students a solid platform of key problem-solving skills that translate easily across programming languages.",
    "cover_image": "http://books.google.com/books/content?id=b-2oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2019"
  },
  {
    "title": "Learn to Code by Solving Problems",
    "authors": [
      "Daniel Zingaro"
    ],
    "description": "Learn to Code by Solving Problems is a practical introduction to programming using Python. It uses coding-competition challenges to teach you the mechanics of coding and how to think like a savvy programmer. Computers are capable of solving almost any problem when given the right instructions. That’s where programming comes in. This beginner’s book will have you writing Python programs right away. You’ll solve interesting problems drawn from real coding competitions and build your programming skills as you go. Every chapter presents problems from coding challenge websites, where online judges test your solutions and provide targeted feedback. As you practice using core Python features, functions, and techniques, you’ll develop a clear understanding of data structures, algorithms, and other programming basics. Bonus exercises invite you to explore new concepts on your own, and multiple-choice questions encourage you to think about how each piece of code works. You’ll learn how to: Run Python code, work with strings, and use variables Write programs that make decisions Make code more efficient with while and for loops Use Python sets, lists, and dictionaries to organize, sort, and search data Design programs using functions and top-down design Create complete-search algorithms and use Big O notation to design more efficient code By the end of the book, you’ll not only be proficient in Python, but you’ll also understand how to think through problems and tackle them with code. Programming languages come and go, but this book gives you the lasting foundation you need to start thinking like a programmer.",
    "cover_image": "http://books.google.com/books/content?id=Wo4TEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "release_year": "2021"
  }
]